{
    "locales": {
        "en": {
            "title": "Portfolio",
            "title_long_prefix": "Take a look at",
            "title_long": "My **Portfolio**"
        },

        "es": {
            "title": "Libro de ideas",
            "title_long_prefix": "Explora",
            "title_long": "Libro de **Ideas**"
        }
    },

    "articles": [
        {
            "id": "portfolio",
            "component": "ArticlePortfolio",
            "config": {},
            "locales": {},

            "categories": [
                {
                    "id": "Training",
                    "locales": {
                        "en": {"singular": "Training", "plural": "Training"},
                        "es": {"singular": "Formacion", "plural": "Training"}
                    }
                },
                {
                    "id": "websites",
                    "locales": {
                        "en": {"singular": "Website", "plural": "Web"},
                        "es": {"singular": "Web", "plural": "Web"}
                    }
                },
                {
                    "id": "comunity",
                    "locales": {
                        "en": {"singular": "Comunity", "plural": "comunity"},
                        "es": {"singular": "Comunidad", "plural": "Utilidades"}
                }
            }
            ],

            "items": [
                {
                    "categoryId": "comunity",
                    "icon": {
                        "img": "",
                        "fa": "fa-solid fa-people-group",
                        "faColors": {"bg": null, "fill": null}
                    },

                    "links": [
                    ],

                    "media": {
                       
                    },

                    "locales": {
                        "en": {
                            "title": "BrainPulse",
                            "text": "A <b>RESTful API</b> backend built with <b>Node.js</b>, designed for high-performance data processing and real-time event handling."
                        },
                        "es": {
                            "title": "Aumentar número de MyC ",
                            "text": "Quiero aumentar el número de MyC de forma que haya como mínimo **1 cada 2 meses**. Dentro de estos a su vez, quiero introducir nuevos formatos que dinamicen la comunidad como que l@s Webmasters sean protagonistas o hacer MyC conjuntos con otras comunidades con sinergias potenciales."
                        }
                    }
                },

                {
                    "categoryId": "Training",
                    "icon": {
                        "img": "images/pictures/project-logo-7.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },

                    "links": [
                    ],

                    "media": {
                    },

                    "locales": {
                        "en": {
                            "title": "MailM8",
                            "text": "A cross-platform email client built with <b>Flutter</b>, providing efficient communication with an intuitive UI for <b>managing emails</b>."
                        },
                        "es": {
                            "title": "Formaciones internas",
                            "text": "Para muchas personas del EST las herramientas que con las que se trabajan son conocidas solo de oídas hasta que se llega al equipo. Es por eso que quiero apostar fuertemente por formación interna del equipo ya sea por nuestra cuenta o incluso buscando formación externa. Con esto, no solo se conseguiría integrantes más capaces, sino que holísticamente el equipo sería más eficaz en su conjunto.  "                        }
                    }
                },

                {
                    "categoryId": "Training",
                    "icon": {
                        "img": "images/pictures/project-logo-6.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },

                    "links": [
                    ],

                    "media": {
                    },

                    "locales": {
                        "en": {
                            "title": "Stackers",
                            "text": "A fully-featured productivity app developed with <b>React Native</b>, enabling users to organize tasks, notes, and projects across multiple devices. It offers <b>cloud sync</b>, intuitive UI, and collaboration features.",
                            "tags": ["React", "Organization", "Notes"]
                        },
                        "es": {
                            "title": "Formación externa: WebMasters",
                            "text": "La comunidad de WebMasters está abierta a todo el mundo, no hace falta ser un experto. Muchas veces creo que la imagen de este cargo ahuyenta a personas que podrían desempeñarlo perfectamente. Por ese motivo me gustaría dar formaciones abiertas sobre diferentes tareas que se llevan a cabo como WebMaster. Esto es aún más importante al tomar en cuenta el cambio de plantilla a Satellite 5, donde algunos procesos sobre la modificación de la web serán distintos.",
                            "tags": ["React", "Organización", "Notas"]
                        }
                    }
                },

                {
                    "categoryId": "websites",
                    "icon": {
                        "img": "images/pictures/project-logo-1.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },

                    "links": [
                    
                    ],

                    "media": {
                    },

                    "locales": {
                        "en": {
                            "title": "SmartCash",
                            "text": "A finance website built using <b>Next.js</b>, allowing users to <b>track budgets</b> and manage their money with interactive charts and insights."                        },
                        "es": {
                            "title": "Web ESN España: Satellite 5",
                            "text": "Como pieza fundamental del trabajo de WPA tengo intención de mantener comletamente actualizada la web de la federación y continuar dándole forma y mejorándola en la nueva versión de la plantilla Satellite 5."                        }
                    }
                },

                {
                    "categoryId": "Training",
                    "icon": {
                        "img": "images/pictures/project-logo-2.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },

                    "links": [
                    ],

                    "media": {
                    },

                    "locales": {
                        "en": {
                            "title": "Snappy",
                            "text": "A powerful photography app designed with <b>Swift</b> for iOS and Android, featuring <b>advanced camera controls</b>, editing tools, and AI-powered filters for quick photo enhancements."                        },
                        "es": {
                            "title": "Formaciones: abiertas a todo el mundo",
                            "text": "Al igual que desde el EdIS se forma en espacios seguros o desde el DC se dan formaciones sobre campañas abiertas a todo el mundo, creo que desde el EST podríamos formar a toda la federación en campos habitualmente ligados a nuestro ámbito como herramientas digitales o IA. Me gustaría además que ambas caras de la moneda fueran abiertas, es decir, desde el EST ofreceríamos nuestro altavoz y ayuda, si fuera necesaria, a cualquier persona que quisiera impartir estos tipos de formaciones, ya que soy consciente que para saber usar estas herramientas no hace falta ser webmaster ni integrante del EST."                        }
                    }
                },

                {
                    "categoryId": "websites",
                    "icon": {
                    },

                    "links": [
                    ],

                    "media": {
                        "youtubeVideo": null,
                        "screenshots": {
                            "aspectRatio": null,
                            "images": []
                        }
                    },

                    "locales": {
                        "en": {
                            "title": "Sweet Scoops",
                            "text": "A recipe website built with <b>WordPress</b> and WooCommerce, featuring a rich collection of <b>dessert recipes</b> and an integrated e-commerce platform."
                        },
                        "es": {
                            "title": "Satellite 5 para las secciones",
                            "text": "Otro eje del trabajo web sería empezar con la implantación de la plantilla de Satellite 5 para las secciones que así lo quieran. Desde el EST brindaremos todo el apoyo que las secciones necesiten en esta transición"
                        }
                    }
                },

                {
                    "categoryId": "websites",
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-guitar",
                        "faColors": {"bg": "#111", "fill": "#EEE"}
                    },

                    "links": [
                    ],

                    "media": {
                    },

                    "locales": {
                        "en": {
                            "title": "RockVerse",
                            "text": "A dynamic music and entertainment website developed with <b>Django</b>, showcasing rock music news, events, and <b>streaming content</b>.",
                            "tags": ["Django", "Music", "Rock"]
                        },
                        "es": {
                            "title": "Web ESN España: extras",
                            "text": "Otro punto importante será el de las demás webs a nivel nacional, como la del secretariado, Ibiza o la wiki. Sé que no serían mi jurisdicción pero quiero matizar que tanto yo como el EST quedaríamos a completa disposición de Junta Nacional, el secretariado y demás equipos para trabajar en las demás webs de ESN España",
                            "tags": ["Django", "Música", "Rock"]
                        }
                    }
                },

                {
                    "categoryId": "comunity",
                    "icon": {
                        "img": "images/pictures/project-logo-4.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },

                    "links": [
                    ],

                    "media": {
                        "youtubeVideo": "https://www.youtube.com/watch?v=bf3Lz33nHy0",
                        "screenshots": {
                            "aspectRatio": null,
                            "images": []
                        }
                    },

                    "locales": {
                        "en": {
                            "title": "Soccer Analytics",
                            "text": "An AI-powered sports analytics platform built with <b>Python</b> and <b>TensorFlow</b>, offering detailed soccer <b>predictions</b> and team management tools."
                        },
                        "es": {
                            "title": "Teambuilding",
                            "text": "Me gustaría aumentar el sentido de pertenencia y de grupo de la comunidad de WebMasters. Para ello, creo que sería reconveniente reestructurar el grupo de Whatsapp actual e incluso considerar según el parecer de los Webmasters cómo facilitar la comunicación. También creo que generar espacios lúdicos podría facilitar esto en gran medida."}
                    }
                }
            ]
        }
    ]
}