{
    "locales": {
        "en": {
            "title": "Experience",
            "title_long_prefix": "Summary of my",
            "title_long": "**Work** Experience"
        },

        "es": {
            "title": "Experiencia",
            "title_long_prefix": "Resumen de mi",
            "title_long": "Experiencia **Laboral**"
        }
    },

    "articles": [
        {
            "id": "work",
            "component": "ArticleTimeline",
            "config": {},
            "locales": {},

            "items": [
                {
                    "icon": {
                        "img": "images/pictures/logo_coconet.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "06/21/2022",
                        "end": "now"
                    },
                    "locales": {
                        "en": {
                            "title": "**Backend** Engineer",
                            "info": "Coconet Mentes Creativas",
                            "text": "I teach children between the ages of 8 and 14 to make their first steps in the world of programming and robotics, using tools such as Scratch, Microbit, Arduino, and Lego Spike. We also prepare them to participate in tournaments and competitions such as the First Lego League (FLL) and the World Robot Olympiad (WRO), where they not only program robots but also develop a comprehensive scientific project.",
                            "tags": ["Scratch", "Arduino", "Lego"]
                        },
                        "es": {
                            "title": "Monitor de STEM",
                            "info": "Coconet Mentes Creativas",
                            "text": "Enseño a niños y adolescentes de entre 8 y 14 años en sus primeros pasos en el mundo de la programación y la robótica, utilizando herramientas como Scratch, Microbit, Arduino y Lego Spike. Asimismo, los preparamos para participar en torneos y competiciones como la First Lego League (FLL) y la World Robot Olympiad (WRO), donde no solo programan robots, sino que también desarrollan un proyecto científico integral.",
                            "tags": ["Scratch", "Arduino", "Lego"]
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/logo_slash.jpg",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "03/19/2025",
                        "end": "now"
                    },
                    "locales": {
                        "en": {
                            "title": "**Backend** Developer",
                            "info": "SlashMobility",
                            "text": "<p>In this position, I implemented the backend of applications and web apps using Kotlin, Java and Springboot. This software was developed using Git and Bitbucket as version management tools, working with an agile methodology. I also deployed to AWS.</p>",
                            "tags": ["Java", "PostgreSQL", "Spring Boot", "RESTful APIs"]
                        },
                        "es": {
                            "title": "Desarrollador **Backend**",
                            "info": "SlashMobility",
                            "text": "<p>En este puesto he implementado el backend de aplicaciones y webapps usando kotlin y Springboot. El desarrollo de este software se ha hecho con git y Bitbucket como herramienta de gestión de versiones y trabajando con metodología ágil. También he realizado los despliegues en AWS</p>",
                            "tags": ["Java", "PostgreSQL", "Spring Boot", "RESTful APIs"]
                        }
                    }
                }
            ]
        }
    ]
}
